InformationRegisters/РабочееМестоЗакупщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РабочееМестоЗакупщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРабочегоМестаЗакупщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.im_ПоставщикиИнтернетМагазина</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыРабочегоМестаЗакупщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыРабочегоМестаЗакупщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КЗаказу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказаИМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказаИМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботеМенеджера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеЗакупщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКладовщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеСервисныхИнженеров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеМЦОА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеЮО</Name>
					<Comment>юр. отдел</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовоеОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РабочиеМеста/Ext/Module.bsl
#Область РабочееМестоЗакупщика

//Процедура записывает товары из заказа в регистр сведений рабочее место закупщика
Процедура ЗаписатьВРабочееМестоЗакупщика(Заказ) Экспорт 
	
	
	НабЗап = РегистрыСведений.РабочееМестоЗакупщика.СоздатьНаборЗаписей();
	НабЗап.Отбор.ЗаказПокупателя.Установить(Заказ);
	НабЗап.Прочитать();
	
	СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе;
	Для Каждого Строка из НабЗап Цикл 
		
		Если не Строка.Статус = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда 
			СтатусОбщий = Строка.Статус; 
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда 
		НабЗап.Очистить();
		НабЗап.Записать();
	КонецЕсли;
	
	//Дандали В. 28.05.2025 +
	Если Заказ.СтатусИМ = Перечисления.СтатусыЗаказаИМ.Отклонено 
		И СтатусОбщий = Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе Тогда
		НабЗап.Очистить();
		НабЗап.Записать();
		Возврат;
	КонецЕсли;
	//Дандали В. 28.05.2025 -
	
	
	Товары = Заказ.Товары.Выгрузить();
	//Дандали В. 30.06.2025 +
	//заккоментировал т.к. кейс когда 1 товар заказывается у разных поставщиков. делается разбивка в заказе покупателя
	//Товары.Свернуть("Номенклатура,Цена","Количество");
	//Дандали В. 30.06.2025 -
	
	Для Каждого стрТовар из Товары Цикл
		
		НабЗап = РегистрыСведений.РабочееМестоЗакупщика.СоздатьНаборЗаписей();
		НабЗап.Отбор.Номенклатура.Установить(стрТовар.Номенклатура);
		НабЗап.Отбор.ЗаказПокупателя.Установить(Заказ);
		НабЗап.Отбор.Ответственный.Установить(Заказ.Ответственный);
		НабЗап.Отбор.УникальныйИдентификаторСтроки.Установить(стрТовар.УникальныйИдентификаторСтроки);
		НабЗап.Прочитать();
		Если НабЗап.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МенЗап 					= РегистрыСведений.РабочееМестоЗакупщика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенЗап, стрТовар);
		МенЗап.ДатаОтгрузки		= ?(ЗначениеЗаполнено(Заказ.ДатаОтгрузки), Заказ.ДатаОтгрузки, ТекущаяДата());
		МенЗап.ДатаРабот		= ТекущаяДата();
		МенЗап.ЗаказПокупателя 	= Заказ;
		МенЗап.Ответственный 	= Заказ.Ответственный;
		МенЗап.Статус			= Перечисления.СтатусыРабочегоМестаЗакупщика.ВРаботе;
		МенЗап.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
